# DataFrame

In [5]:
# 데이터 분석용 라이브러리
import pandas as pd
# 수치 계산용 라이브러리
import numpy as np

In [8]:
#행 인덱스
myindex = ['이순신', '김유신', '강감찬', '광해군', '연산군']

# 열 인덱스
mycolums = ['서울', '부산', '광주', '목포', '경주']

# 1~25까지의 숫자에 10을 곱한 값을 리스트로 저장
# range(1,26)
# onedata * 10
# list 함수 -> 위 결과를 list 형태로 저장하기 위한 함수
mylist = list( 10 * onedata for onedata in range(1,26))

# 출력
print(mylist)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

In [9]:
myframe = pd.DataFrame(np.reshape(mylist, (5,5)),
                       index = myindex,
                       columns = mycolums)
print(myframe)

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

# iloc

In [27]:
from IPython.display import display

print(f"\n# 1 행만 읽어 오기\n{'-'*40}")
result = myframe.iloc[1]
print(type(result))
print(result)
# 시리즈를 데이터프레임으로 변환해서 표로 출력
#display(result.to_frame().T)

# 1 행만 읽어 오기
----------------------------------------
<class 'pandas.core.series.Series'>
서울     60
부산     70
광주     80
목포     90
경주    100
Name: 김유신, dtype: int64

In [28]:
# print(' \n# 몇개의 행을 읽어 오기 ')
print(f"\n# 몇개의 행을 읽어 오기 \n{'-'*40}")
result = myframe.iloc[[1,3]]
print(type(result))
#print(result)
result

# 몇개의 행을 읽어 오기
----------------------------------------
<class 'pandas.core.frame.DataFrame'>

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
광해군  160  170  180  190  200

In [29]:
# print(' \n# 짝수행만 가져오기 ')
print(f"\n# 짝수행만 가져오기\n{'-'*40}")
result = myframe.iloc[0::2]
result

# 짝수행만 가져오기
----------------------------------------

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

# loc

In [30]:
print( '\n# 홀수행만 가져 오기')
print( f'\n# 이순신 행만 Series로 읽어오기 \n{'-'*40}')

result = myframe.loc['이순신']
print(type(result))
print(result)

# 홀수행만 가져 오기

# 이순신 행만 Series로 읽어오기
----------------------------------------
<class 'pandas.core.series.Series'>
서울    10
부산    20
광주    30
목포    40
경주    50
Name: 이순신, dtype: int64

In [32]:
print( '\n# 홀수행만 가져 오기')
print( f'\n# 이순신 행만 DataFrame로 읽어오기 \n{'-'*40}')

result = myframe.loc[['이순신']]
result

# 홀수행만 가져 오기

# 이순신 행만 DataFrame로 읽어오기
----------------------------------------

     서울  부산  광주  목포  경주
이순신  10  20  30  40  50

In [34]:
print(f'\n# 강감찬과 이순신 행 읽어 오기 \n{'-'*40}')
result = myframe.loc[['이순신', '강감찬']]
result

# 강감찬과 이순신 행 읽어 오기
----------------------------------------

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150

# np.random.choice() 함수: 복원 추출을 수행

In [38]:
print(myframe.index)

Index(['이순신', '김유신', '강감찬', '광해군', '연산군'], dtype='object')

In [43]:
mytarget = np.random.choice(myframe.index, 3)
print(mytarget)

['광해군' '연산군' '이순신']

In [46]:
result = myframe.loc[mytarget, mycolums]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
광해군  160  170  180  190  200
광해군  160  170  180  190  200

In [47]:
print( f'\n# 강감찬의 광주 실적 정보 가져오기 \n{'-'*40}')
result = myframe.loc[['강감찬'], ['광주']]
result

# 강감찬의 광주 실적 정보 가져오기
----------------------------------------

      광주
강감찬  130

In [48]:
print( f'\n# 연산군과 광해군의 광주/목포 정보 가져오기 \n{'-'*40}')
result = myframe.loc[['연산군', '강감찬'], ['광주', '목포']]
result

# 연산군과 광해군의 광주/목포 정보 가져오기
----------------------------------------

      광주   목포
연산군  230  240
강감찬  130  140

In [49]:
print( f'\n# 연속적인 데이터 가져오기 \n{'-'*40}')
result = myframe.loc['김유신':'광해군', '광주':'목포']
result

# 연속적인 데이터 가져오기
----------------------------------------

      광주   목포
김유신   80   90
강감찬  130  140
광해군  180  190

In [50]:
print( f'\n# 김유신~광해군까지 부산 실적 정보 가져오기  \n{'-'*40}')
result = myframe.loc['김유신' : '광해군', ['부산']]
result

# 김유신~광해군까지 부산 실적 정보 가져오기
----------------------------------------

      부산
김유신   70
강감찬  120
광해군  170

In [52]:
print( f'\n# Boolean으로 데이터 처리하기 \n{'-'*40}')
result = myframe.loc[[False, True, True, False, True]]
result
# true의 값만 보여줌

# Boolean으로 데이터 처리하기
----------------------------------------

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [53]:
print( f'\n# 부산 실적이 100이하인 항목들 \n{'-'*40}')
result = myframe.loc[myframe['부산'] <= 100]
result

# 부산 실적이 100이하인 항목들
----------------------------------------

     서울  부산  광주  목포   경주
이순신  10  20  30  40   50
김유신  60  70  80  90  100

In [56]:
print( f'\n# 목포 실적이 140인 항목들 \n{'-'*40}')
result = myframe.loc[myframe['목포'] == 140]
result

# 목포 실적이 140인 항목들
----------------------------------------

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150

In [58]:
print( f'\n# 부산 실적이 70이상, 목포 실적이 140 이상인 항목 구하기 \n{'-'*40}')

cond1 = myframe['부산'] >= 70
cond2 = myframe['목포'] >= 140
print(type(cond1))

# 부산 실적이 70이상, 목포 실적이 140 이상인 항목 구하기
----------------------------------------
<class 'pandas.core.series.Series'>

In [59]:
print(cond1)

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
Name: 부산, dtype: bool

In [60]:
print(cond2)

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
Name: 목포, dtype: bool

# all() 함수 = and

# any() 함수 = or

In [69]:
print( f'\n# 구한 두 개의 조건식을 합쳐서 데이터 프레임 df \n{'-'*40}')

df = pd.DataFrame([cond1, cond2])
display(df)

print(df.all())

# 구한 두 개의 조건식을 합쳐서 데이터 프레임 df
----------------------------------------

      이순신    김유신   강감찬   광해군   연산군
부산  False   True  True  True  True
목포  False  False  True  True  True

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
dtype: bool

In [66]:
print(df.any())

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
dtype: bool

In [67]:
result = myframe.loc[df.all()]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [70]:
result = myframe.loc [df.any()]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [71]:
print( f'\n# 람다 함수의 사용 \n{'-'*40}')
result = myframe.loc[lambda df : df['광주'] >= 130]
result

# 람다 함수의 사용
----------------------------------------

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [74]:
print( f'\n# 이순신과 강감찬의 부산 실적을 30으로 변경하기 \n{'-'*40}')
myframe.loc[['이순신', '강감찬'], ['부산']] = 30
myframe

# 이순신과 강감찬의 부산 실적을 30으로 변경하기
----------------------------------------

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90  100
강감찬  110   30  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [76]:
print( f'\n# 김유신부터 광해군까지 경주 실적을 80으로 변경하기 \n{'-'*40}')
myframe.loc['김유신' : '광해군', ['경주']] = 80
myframe

# 김유신부터 광해군까지 경주 실적을 80으로 변경하기
----------------------------------------

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90   80
강감찬  110   30  130  140   80
광해군  160  170  180  190   80
연산군  210  220  230  240  250

In [77]:
print( f'\n# 연산군의 모든 실적을 50으로 변경하기 \n{'-'*40}')
myframe.loc[['연산군'],:] = 50
myframe

# 연산군의 모든 실적을 50으로 변경하기
----------------------------------------

      서울   부산   광주   목포  경주
이순신   10   30   30   40  50
김유신   60   70   80   90  80
강감찬  110   30  130  140  80
광해군  160  170  180  190  80
연산군   50   50   50   50  50

In [78]:
print( f'\n# 모든 사람의 광주 컬럼을 60으로 변경하기 \n{'-'*40}')
myframe.loc[:, ['광주']] = 60
myframe

# 모든 사람의 광주 컬럼을 60으로 변경하기
----------------------------------------

      서울   부산  광주   목포  경주
이순신   10   30  60   40  50
김유신   60   70  60   90  80
강감찬  110   30  60  140  80
광해군  160  170  60  190  80
연산군   50   50  60   50  50

In [79]:
print( f'\n# 경주 실적이 150이하인 데이터를 모두 0으로 변경하기 \n{'-'*40}')
myframe.loc[myframe['경주'] <= 150, ['경주', '광주']] = 0
myframe

# 경주 실적이 150이하인 데이터를 모두 0으로 변경하기
----------------------------------------

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0

In [80]:
print( f'\n# 데이터 프레임 사용하기 \n{'-'*40}')
myframe

# 데이터 프레임 사용하기
----------------------------------------

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0